:PROPERTIES:
:ID:       af832252-c4a9-4364-bdef-59c1a8ea6ebe
:END:
#+title: Bubble sort implementation in Python
#+author: Cash Weaver
#+date: [2022-06-30 Thu 10:52]
#+filetags: :concept:

#+begin_src python :results pp
from typing import List

def bubble_sort(ints: List[int]) -> List[int]:
    def do_pass() -> bool:
        sorted = True

        for i in range(len(ints)-1):
            if ints[i] > ints[i + 1]:
                sorted = False
                swap(i, i+1)

        return sorted

    def swap(indexA: int, indexB: int) -> None:
        valueA = ints[indexA]
        ints[indexA] = ints[indexB]
        ints[indexB] = valueA

    sorted = False
    while not sorted:
        sorted = do_pass()

    return ints

return bubble_sort([10, 5, 4, 40])
#+end_src

#+RESULTS:
: [4, 5, 10, 40]

* Anki :noexport:
:PROPERTIES:
:ANKI_DECK: Default
:END:
